content/blog.org
#+startup: content indent

[[file:index.org][Giovanni's Diary]] > [[file:first-page.org][First Page]] >

* Blog
#+INDEX: Giovanni's Diary!Blog

Hi, I am Giovanni

I am a computer science student with a special interest in *operating
systems*, Linux *system administration*, *cloud computing* and
*security*. Here you will find links to archives of my notes.

- [[file:programming/notes/notes.org][Programming Notes]]: notes about anything related to computer science.
  - [[file:programming/linux/notes.org][Linux Notes]]: notes specific to the Linux kernel
  - [[file:programming/repositories.html][Repositories]]: my public respositories
- [[file:reading/surroundings/chapters.org][Surroundings Chapters]]: descriptions of places I find myself into
- [[file:ephemeris/entries.org][Ephemeris Entries]]: my daily journal
- [[file:reading/blogs.org][Blogs]]: my favourite blogs to read
- Reading: [[file:reading/mauro-corona/notes.org][Mauro Corona Notes]], [[file:reading/stoicism/notes.org][Stoicism Notes]]
- [[file:news.org][What' New]]: a chronological list of new entries all around the diary

Subscribe to the [[file:feeds.org][RSS Feeds]].

[[file:contacts.org][Contacts]]

-----

Travel: [[file:first-page.org][First Page]], [[file:theindex.org][Index]]
