public/blog.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="index.html">Giovanni's Diary</a> &gt; <a href="first-page.html">First Page</a> &gt;
</p>

<div id="outline-container-org716cab3" class="outline-2">
<h2 id="org716cab3">Blog</h2>
<div class="outline-text-2" id="text-org716cab3">
<p>
Hi, I am Giovanni
</p>

<p>
I am a computer science student with a special interest in <b>operating
systems</b>, Linux <b>system administration</b>, <b>cloud computing</b> and
<b>security</b>. Here you will find links to archives of my notes.
</p>

<ul class="org-ul">
<li><a href="programming/notes/notes.html">Programming Notes</a>: notes about anything related to computer science.
<ul class="org-ul">
<li><a href="programming/linux/notes.html">Linux Notes</a>: notes specific to the Linux kernel</li>
<li><a href="programming/repositories.html">Repositories</a>: my public respositories</li>
</ul></li>
<li><a href="reading/surroundings/chapters.html">Surroundings Chapters</a>: descriptions of places I find myself into</li>
<li><a href="ephemeris/entries.html">Ephemeris Entries</a>: my daily journal</li>
<li><a href="reading/blogs.html">Blogs</a>: my favourite blogs to read</li>
<li>Reading: <a href="reading/mauro-corona/notes.html">Mauro Corona Notes</a>, <a href="reading/stoicism/notes.html">Stoicism Notes</a>, <a href="reading/economics/economics.html">Economics</a></li>
<li><a href="news.html">What' New</a>: a chronological list of new entries all around the diary</li>
</ul>

<p>
Subscribe to the <a href="feeds.html">RSS Feeds</a>.
</p>

<p>
<a href="contacts.html">Contacts</a>
</p>

<hr />

<p>
Travel: <a href="first-page.html">First Page</a>, <a href="theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
